{
    "basics": {
      "name": "José Miguel Mangas",
      "label": "Python Developer and Data Analyst",
      "image": "/cv.webp",
      "email": "jmmangas@gmail.com",
      "phone": "+34667475165",
      "url": "https://josemiguelmangas.com",
      "summary": "Python Full Stack Developer with 1 year of experience in Python Development but many years in automation development, front-end design, back-end database management. Experience working for major companies such as Telefónica, Grupo Planeta, and Apple.",
      "location": {
        "address": "2712 Broadway St",
        "postalCode": "CA 94115",
        "city": "Madrid",
        "countryCode": "SP",
        "region": "Spain"
      },
      "profiles": [{
        "network": "X",
        "username": "jmiguelmangas",
        "url": "https://twitter.com/jmiguelmangas",
        "command":"X"
      },
      {
        "network":"Github",
        "username":"jmiguelmangas",
        "url":"https://github.com/jmiguelmangas",
        "command":"G"
      },
      {
        "network":"LinkedIn",
        "username":"josemmangasdeveloper",
        "url":"https://www.linkedin.com/in/josemmangasdeveloper/",
        "command":"L"
      },
      {
        "network":"Phone",
        "username":"+34667475165",
        "url":"tel:34667475165",
        "command":"C"
      }]
    },
    "work": [{
      "name": "Python Developer and Data Analyst",
      "position": "Freelance",
      "url": "https://company.com",
      "startDate": "2023-09-01",
      "endDate": null,
      "summary": "As a freelance Python Developer deeply engaged in diverse community projects, I not only sharpen my Python skills but also contribute actively to collaborative initiatives. My joy lies in supporting and sharing insights with fellow developers, fostering a culture of growth and knowledge-sharing. Engaging in these projects fuels my passion for learning and allows me to master various aspects of Python development. Currently, I'm also pursuing a professional certificate in IBM Data Science, delving into my initial data analysis projects.",
      "highlights": [
      ]
    },
    {
      "name": "Portrait Photographer",
      "position": "Freelance",
      "url": "https://josemiguelmangas.com",
      "startDate": "2010-01-01",
      "endDate": null,
      "summary": "I have been a freelance portrait photographer and business owner for 14 years. I have worked for brands such as Vogue Italia, Huda Beauty and the inditex Group in Europe and the United Arab Emirates.",
      "highlights": [
          "I used my software development skills to create 3 websites, from scratch using Wordpress and Php.","Increased web traffic in 300% the visitors in my brand websites using SEO optimization and html5 good practices."]
    },
    {
      "name": "GoShopia and Dubai Fashion News",
      "position": "CTO and Web Developer",
      "url": "https://goshopia.com",
      "startDate": "2015-01-01",
      "endDate": "2015-12-01",
      "summary": "Dubai Fashion News is the number one online magazine about the Dubai and Middle East fashion industry, Goshopia is an e-commerce that sells sustainable luxury fashion around the world",
      "highlights": [
          "I comprehensively developed an e-commerce platform and a digital magazine from conception to implementation using WordPress."]
    },
    {
      "name": "K-tuin",
      "position": "Apple System Engineer - Software Specialist",
      "url": "https://josemiguelmangas.com",
      "startDate": "2005-01-01",
      "endDate": "2010-01-01",
      "summary": "K-tuin SI is a company specialized in the sale and technical service of Apple products, offering a wide range of devices, accessories, and computer solutions for users and businesses.",
      "highlights": [
          "I developed a work method for technical service, automating tasks through scripting. Reducing 50% the technical service time for a hardware issue, and more than 80% in software issues.","I automated and improved the fault diagnosis system in hardware and software for devices using programming. Reducing the diagnosis time in more than 400%."]
    },
    {
      "name": "Emergia - Jazztel",
      "position": "Specialist in Network and Cloud Data Incidents",
      "url": "https://josemiguelmangas.com",
      "startDate": "2005-01-01",
      "endDate": "2004-01-01",
      "summary": "Emergia is a leading company in technology customer service outsourcing. Within Emergia, I worked for Jazztel, one of the Top 4 Communications Companies nationwide in Spain.",
      "highlights": [
          "I implemented an incident response protocol for cloud-related issues and data recovery in case of loss with a successful rate for lost data of 98%.","Additionally, I developed an operational manual for colleagues in the event of network incidents with computers based on Mac OS.It helps more than 20 technicians people to reduce the incident solving time and endorse their knowledge about that  MAC OS."]
    },
    {
      "name": "Editorial Planeta Sistemas",
      "position": "Server Task Automation Technician",
      "url": "https://josemiguelmangas.com",
      "startDate": "2004-01-01",
      "endDate": "2003-01-01",
      "summary": "Planeta is the largest international Spanish-language publishing company and it is part of the AtresMedia conglomerate. Within Planeta Sistemas, the IT subdivision of the group, I implemented backup systems and spam review on the group's servers",
      "highlights": [
          "Developed backup systems, automation, and security control for email and Lotus Notes reducing filtering time in more than 50% and increasing the group email security by adding spam filters and phishing spam alarms.","Led a team of 3 people, overseeing their tasks and reporting directly to the group's management."]
    },
    {
      "name": "PWC - Telefónica",
      "position": "Linux Scripting Technician - Ethical Hacking",
      "url": "https://josemiguelmangas.com",
      "startDate": "2003-01-01",
      "endDate": "2002-01-01",
      "summary": "Telefónica is one of the largest technology companies in Spain and Latin America. While consulting for Telefónica through PWC, we developed a fault-finding system for both customer databases and Telefónica group websites (Escudo Project).",
      "highlights": [
          "I developed a scripting system to automate tasks for ethical hacking. reducing the critical time of server maintenance during the ethical hacking time in more than 80%.","I worked internationally with more than 15 companies within the Telefónica group fixing over 400 security holes during the project."]
    }
  ],
    "education": [{
      "institution": "IES Lázaro Cardenas",
      "url": "https://institution.com/",
      "area": "High School",
      "studyType": "Technologic Scientific Bachelor",
      "startDate": "1999-09-01",
      "endDate": "2001-09-01",
      "score": "9.0",
      "courses": [
        "Computer Science and Programming with COBOL",
        "Operating Systems",
        "Industrial Technology",
        "Robotic and Physics"
      ],
      "highlights": [
        "DB1101 - Basic SQL"
      ]

    },{"institution": "IES Islas Filipinas",
    "url": "https://www.educa2.madrid.org/web/centro.ies.islasfilipinas.madrid",
    "area": "App Development and Database Management",
    "studyType": "Technical Degree",
    "startDate": "2001-09-01",
    "endDate": "2003-09-01",
    "score": "9.0",
    "courses": [
      "SQL and Database management",
      "Development with C, C++",
      "Software Engineering",
      "Software Development"
    ],
    "highlights": [
      "DB1101 - Basic SQL"
    ]}],
    "awards": [{
      "title": "Award",
      "date": "2014-11-01",
      "awarder": "Company",
      "summary": "There is no spoon."
    }],
    "certificates": [{
        "name": "IBM Data Science Professional Certificate",
        "date": "2024-02-1",
        "issuer": "IBM",
        "url": "https://certificate.com",
        "highlights": ["Covers statistical analysis, machine learning, data visualization, and manipulation.","Practical application of skills through real-world projects and datasets.","Integration of knowledge through a comprehensive final project.","Familiarity with industry-standard tools like IBM Watson Studio and IBM Watson Machine Learning."]
    },{
      "name": "Python Developer CS50P",
      "date": "2023-11-1",
      "issuer": "Harvard Online School",
      "url": "https://certificate.com",
      "highlights": [" Covers essential Python concepts such as data types, control structures, functions, and object-oriented programming principles.","Offers hands-on experience with Python through a series of programming assignments and projects, allowing learners to apply their knowledge to real-world problems.","eaches problem-solving strategies and algorithms using Python, equipping me with the ability to tackle coding challenges efficiently."]
    },    
    {
      "name": "Django Framework for Python Backend Developing",
      "date": "2023-12-1",
      "issuer": "Code Academy",
      "url": "https://certificate.com",
      "highlights": ["Covers the core concepts and components of the Django web framework, including models, views, templates, URLs, and forms.","Provides practical experience building web applications using Django through guided projects and exercises.","Teaches how to integrate databases with Django applications, including working with SQLite and other popular database systems like PostgreSQL and MySQL.","Explains how to implement user authentication and authorization features in Django applications, including user registration, login, and permissions management.","Introduces the Django Rest Framework for building RESTful APIs, enabling learners to create powerful and scalable web APIs with Django.","Discusses best practices for deploying Django applications to production servers and hosting platforms, ensuring how to make their projects accessible to users."]

    },{
      "name": "HTML5 and CSS3 Certified Course",
      "date": "2023-05-1",
      "issuer": "MiMo Programming School",
      "url": "https://certificate.com",
      "highlights": ["Covers essential HTML5 markup and CSS3 styling techniques for building modern, responsive websites."," Introduces modern web development practices and tools, such as Flexbox and Grid layout systems, CSS preprocessors like Sass, and browser developer tools for debugging and optimization."]
    }],
    "skills": [{
      "name": "HTML",
      "level": "Master"
    },
    {
      "name": "CSS",
      "level": "Master"
    },
    {
      "name": "JavaScript",
      "level": "Master"
    },
    {
      "name": "Astro",
      "level": "Master"
    },
    {
      "name": "Python",
      "level": "Master"
    },
    {
      "name": "Django",
      "level": "Master"
    },
    {
      "name": "Pandas",
      "level": "Master"
    },
    {
      "name": "Beautiful Soup",
      "level": "Master"
    },
    {
      "name": "SQL",
      "level": "Master"
    },
    {
      "name": "Wordpress",
      "level": "Master"
    },
    {
      "name": "GIT",
      "level": "Master"
    },
    {
      "name": "Github",
      "level": "Master"
    },
    {
      "name": "Swift",
      "level": "Master"
    }   
  ],
    
    "languages": [{
      "language": "English",
      "fluency": "Fluent",
      "Level": "C1"
    },{
      "language":"Spanish",
      "fluency": "Native",
      "Level": "Native Speaker"
    }],
    "interests": [{
      "name": "Wildlife",
      "keywords": [
        "Ferrets",
        "Unicorns"
      ]
    }],
    "references": [{
      "name": "Jane Doe",
      "reference": "Reference…"
    }],
    "projects": [{
      "name": "Top 4 Football Players Progression",
    "startDate": "2023",
    "endDate": "Currently Working",
    "description": "Personal Project based on real statistics from Premier League, Bundesliga and La Liga from Spain in which I try to solve why Bellingham, Haaland, Mbappe and Vinicius Jr. are progressing so much during the last two years.",
    "isActive": "True",
    "highlights": [
      "Insights about how they are improving their Skills","Follow up during the current season"
  
    ],
    "url": "https://.com/",
    "labels": [
      "Python",
      "Panda","Data Science","MatPlotLyb"
    ]
    },
    {
      "name": "Project",
      "startDate": "2019-01-01",
      "endDate": "2021-01-01",
      "description": "Description...",
      "isActive": "True",
      "highlights": [
        "Won award at AIHacks 2016",
        "Won award at AIHacks 2016"
      ],
      "url": "https://project.com/",
 "labels": [
   "HTML",
   "CSS"
 ]
    }
  ]
  }